"""
Создать множество произвольного содержания. После каждой операции выводить множество на экран.

1) Добавить 34 во множество.
2) Удалить 34 из множества
"""

sett = {1, 23, 'dkfjd'}
print(sett)
#  1
sett.add(34)
print(sett)
#  2
sett.remove(34)
print(sett)
