"""
Создать список произвольного содержания.
Вывести на экран третий, пятый и шестой элементы.
"""

spisok1 = ['1', '2', '3']
spisok2 = [1, 23, 123, 'kpss', spisok1, 2131, 1, 2]

print(spisok2[2])
print(spisok2[4])
print(spisok2[5])
