"""
Даны 2 действительных числа a и b. Получить их сумму, разность и произведение.
"""

a = 42
b = 167

print(a + b)
print(a - b)
print(a * b)
