"""
Пользователь вводит три числа.
Увеличьте первое число в два раза, второе числа уменьшите на 3,
третье число возведите в квадрат и затем найдите сумму новых трех чисел.
"""

num1 = float(input()) * 2
num2 = float(input()) - 3
num3 = float(input()) ** 2
print(num1 + num2 + num3)
