"""
Создать три переменные, содержащие возраст трех ближайших соседей, найти сумма и вывести ее на экран.
Создать еще одну переменную, равную среднему арифметическому возрасту, и вывести на экран.
"""

Pasha = 21
Nikita = 24
Denis = 28

summa = Pasha + Nikita + Denis
mean = summa / 3

print(summa, mean, sep='\n')
