"""
Вывести на экран фразу 'Silence is golden' n раз.
n вводит пользователь.
"""

n = int(input('Enter a number: '))

while n != 0:
    print('Silence is golden')
    n -= 1
