"""
Создать произвольную строку.
Получить подстроку с начала и до седьмого элемента.
Использовать сокращенный и полный методы.
"""

stroka = 'Поровозик, которые смог'

print(stroka[0:7:1])
print(stroka[:7])
