"""
Создать произвольную строку. Получить подстроку с нечетными лементами.
аписать два решения с использованием полной и сокращенной записи.
"""

stroka = 'Поровозик, которые смог'

print(stroka[0:len(stroka):2])
print(stroka[::2])
