"""
Создать переменные firstname, lastname, age с соотв. значениями.
Путём сложения получить строку типа:
"Привет, меня зовут firstname last name, мне age лет.
"""

firstname = 'Костя'
lastname = 'Товкач'
age = '21'

print('Привет, меня зовут ' +
      firstname + ' ' +
      lastname + ', мне ' +
      age + ' год')
