"""
Создать произвольную строку. Получить подстроку с третьего элемента и до конца.
Написать два решения с использованием полной и сокращенной записи.
"""

stroka = 'Поровозик, которые смог'

print(stroka[2:len(stroka):1])
print(stroka[2:])
