"""
Создать произвольную строку. Получить подстроку, которая начинается с пятого символо,
заканчивается предпредпоследним символом с шагом три.
"""

stroka = 'Поровозик, которые смог'

print(stroka[4:-2:3])
